---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.EffectInstance
source: html/add918a7-3992-259e-518d-6583049a5e17.htm
---
# EffectInstance Members

Constructs the effect instance for geometry having the specified vertex format.